run/tests/PolymK+hPolym+Tait/PruebaMalla2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }   
    
    wall1
    {
        type            slip;
    }
    
    wall2
    {
        type            noSlip;
    }
    
    output
    {
        type            zeroGradient;
    }

    input
    {
       /*  type            flowRateInletVelocity;
        massFlowRate    constant 1e-05; // kg/s
        rho             rho;
        //rhoInlet        1000;    // Guess for rho */
       type		fixedValue;
       value		uniform (0 0 0.0002);
    }
}


// ************************************************************************* //
